#Локальные перемнные
# def plus(num1,num2,num3):
#     result = num1+num2+num3#Локальная переменная - переменная, которая доступна внутри функции где ее создали
#     print(result)

# plus(15,43,69)

# for i in range(1,10):
#     result += i#Локальная переменная - переменная, которая доступна внутри функции где ее создали

# print(result)

#Глобальные переменные 
# num = 84#Глобальная переменная - переменная, которая доступна во всей программе

# def show_num():
#     print(num)

# show_num()

#Область видимости переменной
# num = 10#глобальная область видимости - к ней функция обращается если не нашла значения в локальной области видимости

# def show_num():
#     num = 12#Локальная область видимости - к ней функция обращается в первую очередь
#     print(num)

# print(num)

count = 0

def add_one():
    global count#Явно показываем, что нужно использовать count из глобальной области видимости
    count = count+1

add_one()
print(count)