#Работа со списками
books = ["Алгебра","Война и мир","Гарри Поттер","Кафе на краю земли","Властелин колец"]#Создание списка(list)
# print(books)#Вывод всего списка
# print(books[1])#Вывод элемента списка по 1 порядковому номеру
# books[0] = "Энциклопедия"#Замена элемента списка на 0 индексе (Алгебра->Энциклопедия)
# #Срезы списка
# print(books[-1])#-1 - индекс последнего элемента списка
# print(books[1:3])#Срез списка - элементы с 1 по 3 индекс(не включительно)
# print(books[1:])#Срез - от 1 до конца
# print(books[:3])#Срез - от начала до 3
# print(books[::2])#Каждый 2 элемент списка
# print(books[::-1])#Разворот списка в обратную списка
# #Условие со списком
# if "Война и мир" in books:#Проверка наличия элемента внутри списка
#     print("+")

# if "Python" not in books:#Проверка отсутствия элемента
#     print("-")  

#Методы
names = ["Максим","Артем","Степан","Тимур"]
names.append(100)#Метод для добавления элемента в конец списка
names.insert(2,"Павел")#Добавление элемента в опеределенное место по индексу
names.pop()#Удаление последнего
names.pop(1)#Удаление элемента по индексу
names.remove("Степан")#Удаление элемента по названию
print(names)

#Цикл и список
numbers = [12,34,656,234,233]

for number in numbers:#Прохождение с помощью цикла по списку
    print(number*2)#Действие с каждым элементом списка

for book in books:
    print(book.upper())
